[{
  "time": {
    "start": "09:30",
    "end": "10:00"
  },
  "title": "Breakfast and Registration",
  "type": "logistics"
}, {
  "time": {
    "start": "10:00",
    "end": "10:15"
  },
  "title": "Welcome Keynote",
  "type": "talk",
  "presenters": [{
    "name": "Cian ÓMaidin",
    "title": "CEO",
    "organisation": "NearForm",
    "twitter": "cianomaidin",
    "blurb": "Founder and CEO at nearForm, Europe’s leading Node.js consulting company.nearForm focus on server side projects in Node.js optimising for large-scale Mobile and Hardware applications. Founded in 2012, nearForm have developed and deployed over 30 large scale systems in Node. Cian is a peer-to-peer and data-synchronisation enthusiast, and as a result nearForm have pushed the state-of-the-art in the Node eco-system. Cian is Curator of NodeConf.eu, creator of PeerConf and runs Dublin’s monthly Node meet-up.",
    "image": "images/speakers/cian.jpeg"
  }]
}, {
  "time": {
    "start": "10:15",
    "end": "10:45"
  },
  "title": "Microservices at Gilt Group",
  "type": "talk",
  "presenters": [{
    "name": "Sean Smith",
    "title": "Principal Software Engineer",
    "organisation": "Gilt Groupe",
    "twitter": "ssmith",
    "github": "Seanstoppable",
    "blurb": "Sean Smith is a Software Engineer from Canada. He currently works at Gilt Groupe as a Principal Software Engineer. He has worked on a variety of services at Gilt, ranging from third party warehouse systems integration to email content generation and delivery.",
    "image": "images/speakers/sean-smith.jpg"
  }]
}, {
  "time": {
    "start": "10:45",
    "end": "11:00"
  },
  "title": "Coffee",
  "type": "break"
}, {
  "time": {
    "start": "11:00",
    "end": "11:30"
  },
  "title": "Microservices at Netflix",
  "type": "talk",
  "presenters": [{
    "name": "Diptanu Choudhury",
    "title": "Senior Software Engineer",
    "organisation": "Netflix",
    "twitter": "diptanu",
    "github": "diptanu",
    "blurb": "Diptanu is a Senior Platform Engineer at Netflix. He works on core infrastructure like distributed scheduling, IPC libraries, service discovery, distributed tracing that powers various services at Netflix. His main areas of expertise are Ware House Scale Computing, linux containers, highly available systems, distributed persistence.",
    "image": "images/speakers/diptanu.jpeg"
  }]
}, {
  "time": {
    "start": "11:30",
    "end": "11:45"
  },
  "title": "Coffee + Snack",
  "type": "break"
}, {
  "time": {
    "start": "11:45",
    "end": "12:15"
  },
  "title": "Microservices at Hailo",
  "type": "talk",
  "presenters": [{
    "name": "Boyan Dimitrov",
    "title": "Platform Automation Lead",
    "organisation": "Hailo",
    "twitter": "Nathariel",
    "github": "boyand",
    "blurb": "Boyan is a passionate technologist who helps businesses build next generation cloud architectures. By focusing on technology innovation and lightweight processes he helps development teams and organisations improve their velocity and streamline their development workflows. He is heavily vested in building scalable self-healing services and applications and has a profound interest in distributed systems. Boyan holds a bachelors degree in Network Technology from New Bulgarian University and a masters degree in IT Project Management from Aston University. For the past two years as the Platform Automation Lead at Hailo, Boyan has been working on a micro services ecosystem based on Go. The main goal of this architecture is to improve the execution time for teams and individuals and remove cross-team dependencies. This resulted in shortening the software release cycle from weeks to hours and even minutes and constantly adding value to the business.",
    "image": "images/speakers/boyan-dimitrov.png"
  }]
}, {
  "time": {
    "start": "12:15",
    "end": "13:00"
  },
  "title": "So what are microservices?",
  "type": "panel",
  "panel": true,
  "presenters": []
}, {
  "time": {
    "start": "13:00",
    "end": "14:00"
  },
  "title": "Lunch",
  "type": "break"
}, {
  "time": {
    "start": "14:00",
    "end": "14:30"
  },
  "title": "Talk title TBC",
  "type": "talk",
  "presenters": [{
    "name": "Richard Rodger",
    "title": "CTO",
    "organisation": "nearForm",
    "twitter": "rjrodger",
    "github": "rjrodger",
    "blurb": "Richard Rodger is co-founder and chief technical officer (CTO) of nearForm, a Node.js consultancy that builds large-scale enterprise systems. He is an internationally recognized thought leader and speaker on Node.js and microservices. He is also author of Mobile Application Development in the Cloud (Wiley, 2012), and former CTO of FeedHenry, a mobile applications platform that was recently acquired by RedHat. Richard is creator of a number of open source tools, including Senecajs.org and Nodezoo.com. Richard is a regular contributor to the Sunday Business Post newspaper in Ireland, and holds degrees in Mathematics and Philosophy, and Computer Science.",
    "image": "images/speakers/richard-roger.jpg"
  }]
}, {
  "time": {
    "start": "14:30",
    "end": "14:45"
  },
  "title": "Coffee",
  "type": "break"
}, {
  "time": {
    "start": "14:45",
    "end": "15:30"
  },
  "title": "The business implications of microservices",
  "type": "panel",
  "panel": true,
  "presenters": [{
    "name": "Satty Bhens",
    "title": "Co-founder of McKinsey Digital Labs",
    "organisation": "McKinsey Digital Labs",
    "twitter": "sattybhens",
    "github": "sattybhens",
    "blurb": "Satty is global practice leader and co-founder of McKinsey's Digital Labs.  He has extensive experience in digital transformations, defining and implementing modern technology platforms, radically re-designing technology functions and creating innovations labs in major cities across the globe. Satty has recently served clients in Retail, Transportation and Travel, Healthcare and Banking deploying cutting edge technology practices including agile, mobile, big data, devops and UX design. A geek at heart, Satty regularly teaches software development best practices. In 2010 he was selected by US Aid to teach programming in Rwanda, building local IT capabilities that enabled the design and agile development of a new health system using open source platforms.",
    "image": "images/speakers/satty.jpg"
  }]
}, {
  "time": {
    "start": "15:30",
    "end": "15:45"
  },
  "title": "Coffee",
  "type": "break"
}, {
  "time": {
    "start": "15:45",
    "end": "16:15"
  },
  "title": "Docker in the Enterprise",
  "type": "talk",
  "presenters": [{
    "name": "Henk Kolk",
    "title": "Chief Architect",
    "organisation": "ING",
    "twitter": "henkkolk",
    "blurb": "Senior IT manager with a passion for software engineering. Loves talented people that want (need) to create software. Currently responsible for Enterprise Architecture, the ING IT Academy and Continuous Delivery pipelines, platforms and tooling at at ING Domestic Bank NL.",
    "image": "images/speakers/henk.jpeg"
  }]
}, {
  "time": {
    "start": "16:15",
    "end": "16:30"
  },
  "title": "Coffee",
  "type": "break"
}, {
  "time": {
    "start": "16:30",
    "end": "17:00"
  },
  "title": "Go Faster - Impact on technology, process and organisation",
  "type": "talk",
  "presenters": [{
    "name": "Fred George",
    "title": "Principal Consultant",
    "organisation": "Fred George Consulting",
    "twitter": "fgeorge52",
    "github": "fredgeorge",
    "blurb": "Fred George is an industry consultant, and has been writing code for over 46 years in (by his count) over 70 languages. He has delivered projects and products across his career, and in the last decade alone, has worked in the US, India, China, and the UK. He started ThoughtWorks University in Bangalore, India, based on a commercial programming training program he developed in the 90’s. An early adopter of OO and Agile, Fred continues to impact the industry with his leading​edge ideas, most recently advocating MicroS​ervice. Architectures and flat team structures (under the moniker of Programmer Anarchy). Oh, and he still writes code!",
    "image": "images/speakers/fred-george.jpg"
  }]
}, {
  "time": {
    "start": "17:00",
    "end": "17:30"
  },
  "title": "Final Thoughts",
  "type": "talk",
  "presenters": [{
    "name": "Cian ÓMaidin",
    "title": "CEO",
    "organisation": "NearForm",
    "twitter": "cianomaidin",
    "blurb": "Founder and CEO at nearForm, Europe’s leading Node.js consulting company.nearForm focus on server side projects in Node.js optimising for large-scale Mobile and Hardware applications. Founded in 2012, nearForm have developed and deployed over 30 large scale systems in Node. Cian is a peer-to-peer and data-synchronisation enthusiast, and as a result nearForm have pushed the state-of-the-art in the Node eco-system. Cian is Curator of NodeConf.eu, creator of PeerConf and runs Dublin’s monthly Node meet-up.",
    "image": "images/speakers/cian.jpeg"
  }]
}, {
  "time": {
    "start": "17:30",
    "end": "19:00"
  },
  "title": "Drinks and networking",
  "type": "logistics"
}]