[{
  "time": {
    "start": "9:00",
    "end": "9:30"
  },
  "title": "Registration",
  "type": "logistics"
}, {
  "time": {
    "start": "9:30",
    "end": "10:00"
  },
  "title": "Welcome Keynote",
  "type": "talk",
  "presenters": [{
    "name": "Richard Rodger",
    "title": "CTO",
    "organisation": "nearForm",
    "web": "http://www.nearform.com/",
    "twitter": "rjrodger",
    "github": "rjrodger",
    "blurb": "Richard is the co-founder, chief technology officer (CTO) and technology thought leader behind nearForm. An acknowledged early authority on microservices, Richard is the author of The Tao of Microservices and the creator of Seneca, an open source microservices tool kit for Node.js.",
    "image": "images/speakers/richard-roger.jpg"
  }]
}, {
  "time": {
    "start": "10:00",
    "end": "10:30"
  },
  "title": "Tech",
  "type": "tech",
  "presenters": [{
      "name": "Jason Melo",
      "title": "Chief Architect",
      "organisation": "Lifion by ADP",
      "twitter": "jasonmelo",
      "github": "",
      "blurb": "",
      "image": "images/speakers/jmelo.jpg"
    }]
}, {
  "time": {
    "start": "10:30",
    "end": "11:00"
  },
  "title": "Morning Break",
  "type": "break"
}, {
  "time": {
    "start": "11:00",
    "end": "11:30"
  },
  "title": "Talk",
  "type": "talk",
  "presenters": [{
    "name": "Clifton Cunningham ",
    "title": "CTO",
    "organisation": "TES Global",
    "twitter": "clifcunn",
    "github": "cliftonc",
    "blurb": "",
    "image": "images/speakers/ccunningham.jpeg"
  }]
}, {
  "time": {
    "start": "11:30",
    "end": "12:00"
  },
  "title": "Tech",
  "type": "tech",
  "presenters": [{
    "name": "Christian Deger",
    "title": "Software Architect",
    "organisation": "AutoScout24 GmbH",
    "web": "http://www.autoscout24.de.",
    "twitter": "cdeger",
    "github": "christiandeger",
    "blurb": "Christian Deger is a software architect at AutoScout24. He is deeply involved with ‘Tatsu’, the project that is transforming the mature AutoScout24 IT system into a next-generation digital platform. After many years of software development work, Christian’s vision is centered around a 'You build it, you run it' approach, with special focus on AWS, microservices and event sourcing.",
    "abstract": "Christian gives us the inside track on how AutoScout24 is building its ‘Autobahn in the cloud’ to become the market leader in Europe's vehicle listings business. He will explain how his company is reinventing itself by making a radical transition from monoliths to microservices, from .NET on Windows to Scala on Linux, from datacenter to AWS, and from ‘built by devs and run by ops’ to a DevOps mindset.",
    "image": "images/speakers/christian-deger.jpg"
  }]
}, {
  "time": {
    "start": "12:00",
    "end": "12:30"
  },
  "title": "Panel",
  "type": "panel",
  "panel": true,
  "presenters": [{
    "name": "Panel details to be confirmed",
    "title": "",
    "organisation": "",
    "twitter": "",
    "github": "",
    "blurb": "",
    "image": "images/speakers/placeholder.jpg"
  }]
}, {
  "time": {
    "start": "12:30",
    "end": "1:30"
  },
  "title": "Lunch",
  "type": "break"
}, {
  "time": {
    "start": "1:30",
    "end": "2:00"
  },
  "title": "“Remove the Inhibitors to Innovation”",
  "type": "talk",
  "presenters": [{
    "name": "Fred George",
    "title": "Principal Consultant",
    "organisation": "Fred George Consulting",
    "web":"https://www.linkedin.com/in/fred-george-5965b5",
    "twitter": "fgeorge52",
    "github": "fredgeorge",
    "abstract": "A common theme runs through conferences, whether focused on MicroServices, DevOps, Lean Startup, or a myriad of other popular topics: Enabling an organization to Go Faster. I explore the need to go faster (which is hardly new), and three areas inhibitors arise: Technology choices, staid business Processes, and traditional Organization structures and roles. For each, I cite personal experiences in overcoming each.",
    "blurb": "Fred George is an industry consultant, and has been writing code for over 46 years in (by his count) over 70 languages. He has delivered projects and products across his career, and in the last decade alone, has worked in the US, India, China, and the UK. He started ThoughtWorks University in Bangalore, India, based on a commercial programming training program he developed in the 90’s. An early adopter of OO and Agile, Fred continues to impact the industry with his leading ­edge ideas, most recently advocating MicroService Architectures and flat team structures (under the moniker of Programmer Anarchy). Oh, and he still writes code!",
    "image": "images/speakers/fred-george.jpg"
  }]
}, {
  "time": {
    "start": "2:00",
    "end": "2:30"
  },
  "title": "“300: Fighting the Good Fight at the Hot Gates of Micro-Services”",
  "type": "tech",
  "presenters": [{
    "name": "Adrian Trenaman",
    "title": "Software Engineer",
    "organisation": "Gilt",
    "web": "www.gilt.com",
    "twitter": "adrian_trenaman",
    "github": "trenaman",
    "blurb": "As SVP Engineering, Ade leads the engineering teams for Gilt in New York and Dublin. He is an experienced, outspoken software engineer, communicator and leader with over 20 years of experience working with teams throughout Europe, US and Asia in diverse industries such as financial services, telecoms, retail, and manufacturing. In the past, he has held the positions of CTO of Gilt Japan, Tech Lead at Gilt Groupe Ireland, Distinguished Consultant at FuseSource, Progress Software and IONA Technologies, and Lecturer at the National University of Ireland in Maynooth. He became a committer for the Apache Software Foundation in 2010, has acted as an expert reviewer to the European Commission.",
    "image": "images/speakers/adrian-trenaman.jpg"
  }]
}, {
  "time": {
    "start": "2:30",
    "end": "3:00"
  },
  "title": "Afternoon break",
  "type": "break"
}, {
  "time": {
    "start": "3:00",
    "end": "3:30"
  },
  "title": "“Microservices and Containers. How much faster than a VM?!”",
  "type": "talk",
  "presenters": [{
    "name": "Anne Currie",
    "title": "Co Founder & Consultant",
    "organisation": "Force12.io",
    "web": "http://force12.io/",
    "twitter": "anne_e_currie",
    "github": "",
    "blurb": "Anne Currie has been in the tech industry for over 20 years, working on everything from core server technology to pioneering e-commerce platforms. She is currently CTO of Microscaling Systems, with a focus on the convergence of microservices and containers.",
    "abstract": "Are containers really orders of magnitude faster at instantiating than VMs? Or is that just hype? How might this change future architectures? What will the effect be on Microservices? Come to Anne's talk to find out…",
    "image": "images/speakers/anne-currie.jpg"
  }]
}, {
  "time": {
    "start": "3:30",
    "end": "4:00"
  },
  "title": "Tech",
  "type": "tech",
  "presenters": [{
    "name": "Peter Elger",
    "title": "Director of Engineering",
    "organisation": "nearForm",
    "web": "http://www.nearform.com/",
    "twitter": "pelger",
    "github": "pelger",
    "blurb": "Director of Engineering at nearForm, Peter started his career working as chief software architect at the Joint-Jet Fusion Undertaking in the UK where he spent 5 years building data acquisition and analysis systems for a Tokamak Fusion reactor. Peter has held technical leadership roles across a broad base of the IT industry in both the research and commercial sectors including nuclear fusion research, software disaster recovery, telecommunications and broadcast media. Companies include BetaPond, TSSG, Waterford Technologies and Indigo Stone. Peter has a B.Sc. in Physics and an M.Sc. in Computer Science. Peter likes lifting really heavy weights and kick-boxing when not mashing the keyboard and delivering projects.",
    "image": "images/speakers/peterelger.png"
  }]
}, {
  "time": {
    "start": "4.00",
    "end": "4:30"
  },
  "title": "Panel",
  "type": "panel",
  "panel": true,
  "presenters": [{
    "name": "Panel details to be confirmed",
    "title": "",
    "organisation": "",
    "twitter": "",
    "github": "",
    "blurb": "",
    "image": "images/speakers/placeholder.jpg"
  }]
}, {
  "time": {
    "start": "4:30",
    "end": "5:00"
  },
  "title": "Final Thoughts",
  "type": "talk",
  "presenters": [{
    "name": "Cian Ó Maidín",
    "title": "CEO",
    "organisation": "nearForm",
    "web": "http://www.nearform.com/",
    "twitter": "cianomaidin",
    "blurb": "Cian is the co-founder and visionary chief executive officer (CEO) behind nearForm. Very early on, Cian saw how Node.js could help software work better and formulated his vision of bringing the new Node.js technology into the mainstream. He is committed to making that happen through nearForm. He is an established entrepreneur, Node.js community leader, creator of the NodeDublin conference and curator of NodeConf EU, Europe’s annual four-day Node.js conference. In 2012, Cian was voted amongst “Ireland’s top technology leaders”.",
    "image": "images/speakers/cian.jpeg"
  }]
}]
